GopalSaraf/Practicals/PSDL/include/proc/pic18f24k22.inc
// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_INT0_POSN                          equ 0000h
PORTB_INT0_POSITION                      equ 0000h
PORTB_INT0_SIZE                          equ 0001h
PORTB_INT0_LENGTH                        equ 0001h
PORTB_INT0_MASK                          equ 0001h
PORTB_INT1_POSN                          equ 0001h
PORTB_INT1_POSITION                      equ 0001h
PORTB_INT1_SIZE                          equ 0001h
PORTB_INT1_LENGTH                        equ 0001h
PORTB_INT1_MASK                          equ 0002h
PORTB_INT2_POSN                          equ 0002h
PORTB_INT2_POSITION                      equ 0002h
PORTB_INT2_SIZE                          equ 0001h
PORTB_INT2_LENGTH                        equ 0001h
PORTB_INT2_MASK                          equ 0004h
PORTB_CCP2_POSN                          equ 0003h
PORTB_CCP2_POSITION                      equ 0003h
PORTB_CCP2_SIZE                          equ 0001h
PORTB_CCP2_LENGTH                        equ 0001h
PORTB_CCP2_MASK                          equ 0008h
PORTB_KBI0_POSN                          equ 0004h
PORTB_KBI0_POSITION                      equ 0004h
PORTB_KBI0_SIZE                          equ 0001h
PORTB_KBI0_LENGTH                        equ 0001h
PORTB_KBI0_MASK                          equ 0010h
PORTB_KBI1_POSN                          equ 0005h
PORTB_KBI1_POSITION                      equ 0005h
PORTB_KBI1_SIZE                          equ 0001h
PORTB_KBI1_LENGTH                        equ 0001h
PORTB_KBI1_MASK                          equ 0020h
PORTB_KBI2_POSN                          equ 0006h
PORTB_KBI2_POSITION                      equ 0006h
PORTB_KBI2_SIZE                          equ 0001h
PORTB_KBI2_LENGTH                        equ 0001h
PORTB_KBI2_MASK                          equ 0040h
PORTB_KBI3_POSN                          equ 0007h
PORTB_KBI3_POSITION                      equ 0007h
PORTB_KBI3_SIZE                          equ 0001h
PORTB_KBI3_LENGTH                        equ 0001h
PORTB_KBI3_MASK                          equ 0080h
PORTB_AN12_POSN                          equ 0000h
PORTB_AN12_POSITION                      equ 0000h
PORTB_AN12_SIZE                          equ 0001h
PORTB_AN12_LENGTH                        equ 0001h
PORTB_AN12_MASK                          equ 0001h
PORTB_AN10_POSN                          equ 0001h
PORTB_AN10_POSITION                      equ 0001h
PORTB_AN10_SIZE                          equ 0001h
PORTB_AN10_LENGTH                        equ 0001h
PORTB_AN10_MASK                          equ 0002h
PORTB_AN8_POSN                           equ 0002h
PORTB_AN8_POSITION                       equ 0002h
PORTB_AN8_SIZE                           equ 0001h
PORTB_AN8_LENGTH                         equ 0001h
PORTB_AN8_MASK                           equ 0004h
PORTB_AN9_POSN                           equ 0003h
PORTB_AN9_POSITION                       equ 0003h
PORTB_AN9_SIZE                           equ 0001h
PORTB_AN9_LENGTH                         equ 0001h
PORTB_AN9_MASK                           equ 0008h
PORTB_AN11_POSN                          equ 0004h
PORTB_AN11_POSITION                      equ 0004h
PORTB_AN11_SIZE                          equ 0001h
PORTB_AN11_LENGTH                        equ 0001h
PORTB_AN11_MASK                          equ 0010h
PORTB_AN13_POSN                          equ 0005h
PORTB_AN13_POSITION                      equ 0005h
PORTB_AN13_SIZE                          equ 0001h
PORTB_AN13_LENGTH                        equ 0001h
PORTB_AN13_MASK                          equ 0020h
PORTB_TX2_POSN                           equ 0006h
PORTB_TX2_POSITION                       equ 0006h
PORTB_TX2_SIZE                           equ 0001h
PORTB_TX2_LENGTH                         equ 0001h
PORTB_TX2_MASK                           equ 0040h
PORTB_RX2_POSN                           equ 0007h
PORTB_RX2_POSITION                       equ 0007h
PORTB_RX2_SIZE                           equ 0001h
PORTB_RX2_LENGTH                         equ 0001h
PORTB_RX2_MASK                           equ 0080h
PORTB_FLT0_POSN                          equ 0000h
PORTB_FLT0_POSITION                      equ 0000h
PORTB_FLT0_SIZE                          equ 0001h
PORTB_FLT0_LENGTH                        equ 0001h
PORTB_FLT0_MASK                          equ 0001h
PORTB_C12IN3M_POSN                       equ 0001h
PORTB_C12IN3M_POSITION                   equ 0001h
PORTB_C12IN3M_SIZE                       equ 0001h
PORTB_C12IN3M_LENGTH                     equ 0001h
PORTB_C12IN3M_MASK                       equ 0002h
PORTB_P1B_POSN                           equ 0002h
PORTB_P1B_POSITION                       equ 0002h
PORTB_P1B_SIZE                           equ 0001h
PORTB_P1B_LENGTH                         equ 0001h
PORTB_P1B_MASK                           equ 0004h
PORTB_C12IN2M_POSN                       equ 0003h
PORTB_C12IN2M_POSITION                   equ 0003h
PORTB_C12IN2M_SIZE                       equ 0001h
PORTB_C12IN2M_LENGTH                     equ 0001h
PORTB_C12IN2M_MASK                       equ 0008h
PORTB_T5G_POSN                           equ 0004h
PORTB_T5G_POSITION                       equ 0004h
PORTB_T5G_SIZE                           equ 0001h
PORTB_T5G_LENGTH                         equ 0001h
PORTB_T5G_MASK                           equ 0010h
PORTB_T1G_POSN                           equ 0005h
PORTB_T1G_POSITION                       equ 0005h
PORTB_T1G_SIZE                           equ 0001h
PORTB_T1G_LENGTH                         equ 0001h
PORTB_T1G_MASK                           equ 0020h
PORTB_CK2_POSN                           equ 0006h
PORTB_CK2_POSITION                       equ 0006h
PORTB_CK2_SIZE                           equ 0001h
PORTB_CK2_LENGTH                         equ 0001h
PORTB_CK2_MASK                           equ 0040h
PORTB_DT2_POSN                           equ 0007h
PORTB_DT2_POSITION                       equ 0007h
PORTB_DT2_SIZE                           equ 0001h
PORTB_DT2_LENGTH                         equ 0001h
PORTB_DT2_MASK                           equ 0080h
PORTB_SRI_POSN                           equ 0000h
PORTB_SRI_POSITION                       equ 0000h
PORTB_SRI_SIZE                           equ 0001h
PORTB_SRI_LENGTH                         equ 0001h
PORTB_SRI_MASK                           equ 0001h
PORTB_C12IN3N_POSN                       equ 0001h
PORTB_C12IN3N_POSITION                   equ 0001h
PORTB_C12IN3N_SIZE                       equ 0001h
PORTB_C12IN3N_LENGTH                     equ 0001h
PORTB_C12IN3N_MASK                       equ 0002h
PORTB_CTED1_POSN                         equ 0002h
PORTB_CTED1_POSITION                     equ 0002h
PORTB_CTED1_SIZE                         equ 0001h
PORTB_CTED1_LENGTH                       equ 0001h
PORTB_CTED1_MASK                         equ 0004h
PORTB_C12IN2N_POSN                       equ 0003h
PORTB_C12IN2N_POSITION                   equ 0003h
PORTB_C12IN2N_SIZE                       equ 0001h
PORTB_C12IN2N_LENGTH                     equ 0001h
PORTB_C12IN2N_MASK                       equ 0008h
PORTB_P1D_POSN                           equ 0004h
PORTB_P1D_POSITION                       equ 0004h
PORTB_P1D_SIZE                           equ 0001h
PORTB_P1D_LENGTH                         equ 0001h
PORTB_P1D_MASK                           equ 0010h
PORTB_CCP3_POSN                          equ 0005h
PORTB_CCP3_POSITION                      equ 0005h
PORTB_CCP3_SIZE                          equ 0001h
PORTB_CCP3_LENGTH                        equ 0001h
PORTB_CCP3_MASK                          equ 0020h
PORTB_PGC_POSN                           equ 0006h
PORTB_PGC_POSITION                       equ 0006h
PORTB_PGC_SIZE                           equ 0001h
PORTB_PGC_LENGTH                         equ 0001h
PORTB_PGC_MASK                           equ 0040h
PORTB_PGD_POSN                           equ 0007h
PORTB_PGD_POSITION                       equ 0007h
PORTB_PGD_SIZE                           equ 0001h
PORTB_PGD_LENGTH                         equ 0001h
PORTB_PGD_MASK                           equ 0080h
PORTB_CCP4_POSN                          equ 0000h
PORTB_CCP4_POSITION                      equ 0000h
PORTB_CCP4_SIZE                          equ 0001h
PORTB_CCP4_LENGTH                        equ 0001h
PORTB_CCP4_MASK                          equ 0001h
PORTB_P1C_POSN                           equ 0001h
PORTB_P1C_POSITION                       equ 0001h
PORTB_P1C_SIZE                           equ 0001h
PORTB_P1C_LENGTH                         equ 0001h
PORTB_P1C_MASK                           equ 0002h
PORTB_SDA2_POSN                          equ 0002h
PORTB_SDA2_POSITION                      equ 0002h
PORTB_SDA2_SIZE                          equ 0001h
PORTB_SDA2_LENGTH                        equ 0001h
PORTB_SDA2_MASK                          equ 0004h
PORTB_CTED2_POSN                         equ 0003h
PORTB_CTED2_POSITION                     equ 0003h
PORTB_CTED2_SIZE                         equ 0001h
PORTB_CTED2_LENGTH                       equ 0001h
PORTB_CTED2_MASK                         equ 0008h
PORTB_T3CKI_POSN                         equ 0005h
PORTB_T3CKI_POSITION                     equ 0005h
PORTB_T3CKI_SIZE                         equ 0001h
PORTB_T3CKI_LENGTH                       equ 0001h
PORTB_T3CKI_MASK                         equ 0020h
PORTB_SS2_POSN                           equ 0000h
PORTB_SS2_POSITION                       equ 0000h
PORTB_SS2_SIZE                           equ 0001h
PORTB_SS2_LENGTH                         equ 0001h
PORTB_SS2_MASK                           equ 0001h
PORTB_SCL2_POSN                          equ 0001h
PORTB_SCL2_POSITION                      equ 0001h
PORTB_SCL2_SIZE                          equ 0001h
PORTB_SCL2_LENGTH                        equ 0001h
PORTB_SCL2_MASK                          equ 0002h
PORTB_SDI2_POSN                          equ 0002h
PORTB_SDI2_POSITION                      equ 0002h
PORTB_SDI2_SIZE                          equ 0001h
PORTB_SDI2_LENGTH                        equ 0001h
PORTB_SDI2_MASK                          equ 0004h
PORTB_P2A_POSN                           equ 0003h
PORTB_P2A_POSITION                       equ 0003h
PORTB_P2A_SIZE                           equ 0001h
PORTB_P2A_LENGTH                         equ 0001h
PORTB_P2A_MASK                           equ 0008h
PORTB_P3A_POSN                           equ 0005h
PORTB_P3A_POSITION                       equ 0005h
PORTB_P3A_SIZE                           equ 0001h
PORTB_P3A_LENGTH                         equ 0001h
PORTB_P3A_MASK                           equ 0020h
PORTB_NOT_SS2_POSN                       equ 0000h
PORTB_NOT_SS2_POSITION                   equ 0000h
PORTB_NOT_SS2_SIZE                       equ 0001h
PORTB_NOT_SS2_LENGTH                     equ 0001h
PORTB_NOT_SS2_MASK                       equ 0001h
PORTB_nSS2_POSN                          equ 0000h
PORTB_nSS2_POSITION                      equ 0000h
PORTB_nSS2_SIZE                          equ 0001h
PORTB_nSS2_LENGTH                        equ 0001h
PORTB_nSS2_MASK                          equ 0001h
PORTB_SCK2_POSN                          equ 0001h
PORTB_SCK2_POSITION                      equ 0001h
PORTB_SCK2_SIZE                          equ 0001h
PORTB_SCK2_LENGTH                        equ 0001h
PORTB_SCK2_MASK                          equ 0002h
PORTB_SDO2_POSN                          equ 0003h
PORTB_SDO2_POSITION                      equ 0003h
PORTB_SDO2_SIZE                          equ 0001h
PORTB_SDO2_LENGTH                        equ 0001h
PORTB_SDO2_MASK                          equ 0008h
PORTB_P2B_POSN                           equ 0005h
PORTB_P2B_POSITION                       equ 0005h
PORTB_P2B_SIZE                           equ 0001h
PORTB_P2B_LENGTH                         equ 0001h
PORTB_P2B_MASK                           equ 0020h
PORTB_CCP2_PA2_POSN                      equ 0003h
PORTB_CCP2_PA2_POSITION                  equ 0003h
PORTB_CCP2_PA2_SIZE                      equ 0001h
PORTB_CCP2_PA2_LENGTH                    equ 0001h
PORTB_CCP2_PA2_MASK                      equ 0008h

